avr-rust/avrd/packs/xmegae/ATxmega16E5.atdf
        <register caption="Channel 1 Control Register" name="CH1CTRL" offset="0x09" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 2 Control Register" name="CH2CTRL" offset="0x0A" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 3 Control Register" name="CH3CTRL" offset="0x0B" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 4 Control Register" name="CH4CTRL" offset="0x0C" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 5 Control Register" name="CH5CTRL" offset="0x0D" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 6 Control Register" name="CH6CTRL" offset="0x0E" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Channel 7 Control Register" name="CH7CTRL" offset="0x0F" size="1">
          <bitfield caption="Digital Filter" mask="0x07" name="DIGFILT" values="EVSYS_DIGFILT"/>
        </register>
        <register caption="Event Strobe" name="STROBE" offset="0x10" size="1"/>
        <register caption="Event Data" name="DATA" offset="0x11" size="1"/>
        <register caption="Digital Filter Control Register" name="DFCTRL" offset="0x12" size="1">
          <bitfield caption="Prescaler Filter" mask="0xF0" name="PRESCFILT" values="EVSYS_PRESCFILT"/>
          <bitfield caption="Prescaler Filter Select" mask="0x08" name="FILTSEL"/>
          <bitfield caption="Prescaler" mask="0x07" name="PRESC" values="EVSYS_PRESCALER"/>
        </register>
      </register-group>
      <value-group caption="Event Channel multiplexer input selection" name="EVSYS_CHMUX">
        <value caption="Off" name="OFF" value="0x00"/>
        <value caption="RTC Overflow" name="RTC_OVF" value="0x08"/>
        <value caption="RTC Compare Match" name="RTC_CMP" value="0x09"/>
        <value caption="Analog Comparator A Channel 0" name="ACA_CH0" value="0x10"/>
        <value caption="Analog Comparator A Channel 1" name="ACA_CH1" value="0x11"/>
        <value caption="Analog Comparator A Window" name="ACA_WIN" value="0x12"/>
        <value caption="ADC A Channel 0" name="ADCA_CH0" value="0x20"/>
        <value caption="Port A, Pin0" name="PORTA_PIN0" value="0x50"/>
        <value caption="Port A, Pin1" name="PORTA_PIN1" value="0x51"/>
        <value caption="Port A, Pin2" name="PORTA_PIN2" value="0x52"/>
        <value caption="Port A, Pin3" name="PORTA_PIN3" value="0x53"/>
        <value caption="Port A, Pin4" name="PORTA_PIN4" value="0x54"/>
        <value caption="Port A, Pin5" name="PORTA_PIN5" value="0x55"/>
        <value caption="Port A, Pin6" name="PORTA_PIN6" value="0x56"/>
        <value caption="Port A, Pin7" name="PORTA_PIN7" value="0x57"/>
        <value caption="Port C, Pin0" name="PORTC_PIN0" value="0x60"/>
        <value caption="Port C, Pin1" name="PORTC_PIN1" value="0x61"/>
        <value caption="Port C, Pin2" name="PORTC_PIN2" value="0x62"/>
        <value caption="Port C, Pin3" name="PORTC_PIN3" value="0x63"/>
        <value caption="Port C, Pin4" name="PORTC_PIN4" value="0x64"/>
        <value caption="Port C, Pin5" name="PORTC_PIN5" value="0x65"/>
        <value caption="Port C, Pin6" name="PORTC_PIN6" value="0x66"/>
        <value caption="Port C, Pin7" name="PORTC_PIN7" value="0x67"/>
        <value caption="Port D, Pin0" name="PORTD_PIN0" value="0x68"/>
        <value caption="Port D, Pin1" name="PORTD_PIN1" value="0x69"/>
        <value caption="Port D, Pin2" name="PORTD_PIN2" value="0x6A"/>
        <value caption="Port D, Pin3" name="PORTD_PIN3" value="0x6B"/>
        <value caption="Port D, Pin4" name="PORTD_PIN4" value="0x6C"/>
        <value caption="Port D, Pin5" name="PORTD_PIN5" value="0x6D"/>
        <value caption="Port D, Pin6" name="PORTD_PIN6" value="0x6E"/>
        <value caption="Port D, Pin7" name="PORTD_PIN7" value="0x6F"/>
        <value caption="Prescaler, divide by 1" name="PRESCALER_1" value="0x80"/>
        <value caption="Prescaler, divide by 2" name="PRESCALER_2" value="0x81"/>
        <value caption="Prescaler, divide by 4" name="PRESCALER_4" value="0x82"/>
        <value caption="Prescaler, divide by 8" name="PRESCALER_8" value="0x83"/>
        <value caption="Prescaler, divide by 16" name="PRESCALER_16" value="0x84"/>
        <value caption="Prescaler, divide by 32" name="PRESCALER_32" value="0x85"/>
        <value caption="Prescaler, divide by 64" name="PRESCALER_64" value="0x86"/>
        <value caption="Prescaler, divide by 128" name="PRESCALER_128" value="0x87"/>
        <value caption="Prescaler, divide by 256" name="PRESCALER_256" value="0x88"/>
        <value caption="Prescaler, divide by 512" name="PRESCALER_512" value="0x89"/>
        <value caption="Prescaler, divide by 1024" name="PRESCALER_1024" value="0x8A"/>
        <value caption="Prescaler, divide by 2048" name="PRESCALER_2048" value="0x8B"/>
        <value caption="Prescaler, divide by 4096" name="PRESCALER_4096" value="0x8C"/>
        <value caption="Prescaler, divide by 8192" name="PRESCALER_8192" value="0x8D"/>
        <value caption="Prescaler, divide by 16384" name="PRESCALER_16384" value="0x8E"/>
        <value caption="Prescaler, divide by 32768" name="PRESCALER_32768" value="0x8F"/>
        <value caption="XCL BTC0 underflow" name="XCL_UNF0" value="0xB0"/>
        <value caption="XCL BTC1 underflow" name="XCL_UNF1" value="0xB1"/>
        <value caption="XCL BTC0 capture or compare" name="XCL_CC0" value="0xB2"/>
        <value caption="XCL BTC1 capture or compare" name="XCL_CC1" value="0xB3"/>
        <value caption="XCL PEC0 restart" name="XCL_PEC0" value="0xB4"/>
        <value caption="XCL PEC1 restart" name="XCL_PEC1" value="0xB5"/>
        <value caption="XCL LUT0 output" name="XCL_LUT0" value="0xB6"/>
        <value caption="XCL LUT1 output" name="XCL_LUT1" value="0xB7"/>
        <value caption="Timer/Counter C4 Overflow" name="TCC4_OVF" value="0xC0"/>
        <value caption="Timer/Counter C4 Error" name="TCC4_ERR" value="0xC1"/>
        <value caption="Timer/Counter C4 Compare or Capture A" name="TCC4_CCA" value="0xC4"/>
        <value caption="Timer/Counter C4 Compare or Capture B" name="TCC4_CCB" value="0xC5"/>
        <value caption="Timer/Counter C4 Compare or Capture C" name="TCC4_CCC" value="0xC6"/>
        <value caption="Timer/Counter C4 Compare or Capture D" name="TCC4_CCD" value="0xC7"/>
        <value caption="Timer/Counter C5 Overflow" name="TCC5_OVF" value="0xC8"/>
        <value caption="Timer/Counter C5 Error" name="TCC5_ERR" value="0xC9"/>
        <value caption="Timer/Counter C5 Compare or Capture A" name="TCC5_CCA" value="0xCC"/>
        <value caption="Timer/Counter C5 Compare or Capture B" name="TCC5_CCB" value="0xCD"/>
        <value caption="Timer/Counter D5 Overflow" name="TCD5_OVF" value="0xD8"/>
        <value caption="Timer/Counter D5 Error" name="TCD5_ERR" value="0xD9"/>
        <value caption="Timer/Counter D5 Compare or Capture A" name="TCD5_CCA" value="0xDC"/>
        <value caption="Timer/Counter D5 Compare or Capture B" name="TCD5_CCB" value="0xDD"/>
      </value-group>
      <value-group caption="Quadrature Decoder Index Recognition Mode" name="EVSYS_QDIRM">
        <value caption="QDPH0 = 0, QDPH90 = 0" name="00" value="0x00"/>
        <value caption="QDPH0 = 0, QDPH90 = 1" name="01" value="0x01"/>
        <value caption="QDPH0 = 1, QDPH90 = 0" name="10" value="0x02"/>
        <value caption="QDPH0 = 1, QDPH90 = 1" name="11" value="0x03"/>
      </value-group>
