avr-rust/avrd/packs/xmegae/ATxmega16E5.atdf
      <value-group caption="Compare Interrupt level" name="RTC_COMPINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Overflow Interrupt level" name="RTC_OVFINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <interrupt-group name="RTC">
        <interrupt index="0" name="OVF" caption="Overflow Interrupt"/>
        <interrupt index="1" name="COMP" caption="Compare Interrupt"/>
      </interrupt-group>
    </module>
    <module name="XCL" id="I3008" caption="XMEGA Custom Logic">
      <register-group caption="XMEGA Custom Logic" name="XCL" size="16">
        <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="LUT0 Output Enable" mask="0xC0" name="LUT0OUTEN" values="XCL_LUT0OUTEN"/>
          <bitfield caption="Port Selection" mask="0x30" name="PORTSEL" values="XCL_PORTSEL"/>
          <bitfield caption="LUT Configuration" mask="0x07" name="LUTCONF" values="XCL_LUTCONF"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Input Selection 3" mask="0xC0" name="IN3SEL" values="XCL_INSEL"/>
          <bitfield caption="Input Selection 2" mask="0x30" name="IN2SEL" values="XCL_INSEL"/>
          <bitfield caption="Input Selection 1" mask="0x0C" name="IN1SEL" values="XCL_INSEL"/>
          <bitfield caption="Input Selection 0" mask="0x03" name="IN0SEL" values="XCL_INSEL"/>
        </register>
        <register caption="Control Register C" name="CTRLC" offset="0x02" size="1">
          <bitfield caption="Asynchronous Event Line Selection for LUT1" mask="0x80" name="EVASYSEL1"/>
          <bitfield caption="Asynchronous Event Line Selection for LUT0" mask="0x40" name="EVASYSEL0"/>
          <bitfield caption="Delay Selection" mask="0x30" name="DLYSEL" values="XCL_DLYSEL"/>
          <bitfield caption="Delay Configuration on LUT1" mask="0x0C" name="DLY1CONF" values="XCL_DLYCONF"/>
          <bitfield caption="Delay Configuration on LUT0" mask="0x03" name="DLY0CONF" values="XCL_DLYCONF"/>
        </register>
        <register caption="Control Register D" name="CTRLD" offset="0x03" size="1">
          <bitfield caption="Truth Table of LUT1" mask="0xF0" name="TRUTH1"/>
          <bitfield caption="Truth Table of LUT0" mask="0x0F" name="TRUTH0"/>
        </register>
        <register caption="Control Register E" name="CTRLE" offset="0x04" size="1">
          <bitfield caption="Timer/Counter Command Selection" mask="0x80" name="CMDSEL" values="XCL_CMDSEL"/>
          <bitfield caption="Timer/Counter Selection" mask="0x70" name="TCSEL" values="XCL_TCSEL"/>
          <bitfield caption="Clock Selection" mask="0x0F" name="CLKSEL" values="XCL_CLKSEL"/>
        </register>
        <register caption="Control Register F" name="CTRLF" offset="0x05" size="1">
          <bitfield caption="Command Enable" mask="0xC0" name="CMDEN" values="XCL_CMDEN"/>
          <bitfield caption="Compare Channel 1 Output Value" mask="0x20" name="CMP1" values="XCL_CMPEN"/>
          <bitfield caption="Compare Channel 0 Output Value" mask="0x10" name="CMP0" values="XCL_CMPEN"/>
          <bitfield caption="Compare or Capture Channel 1 Enable" mask="0x08" name="CCEN1"/>
          <bitfield caption="Compare or Capture Channel 0 Enable" mask="0x04" name="CCEN0"/>
          <bitfield caption="Timer/Counter Mode" mask="0x03" name="MODE" values="XCL_TCMODE"/>
        </register>
        <register caption="Control Register G" name="CTRLG" offset="0x06" size="1">
          <bitfield caption="Event Action Enable" mask="0x80" name="EVACTEN"/>
          <bitfield caption="Event Action Selection on Timer/Counter 1" mask="0x60" name="EVACT1" values="XCL_EVACT"/>
          <bitfield caption="Event Action Selection on Timer/Counter 0" mask="0x18" name="EVACT0" values="XCL_EVACT"/>
          <bitfield caption="Event Source Selection" mask="0x07" name="EVSRC" values="XCL_EVSRC"/>
        </register>
        <register caption="Interrupt Control Register" name="INTCTRL" offset="0x07" size="1">
          <bitfield caption="Underflow 1 Interrupt Enable" mask="0x80" name="UNF1IE"/>
          <bitfield caption="Peripheral Counter 1 Interrupt Enable" mask="0x80" name="PEC1IE"/>
          <bitfield caption="Peripheral High Counter 2 Interrupt Enable" mask="0x80" name="PEC21IE"/>
          <bitfield caption="Underflow 0 Interrupt Enable" mask="0x40" name="UNF0IE"/>
          <bitfield caption="Peripheral Counter 0 Interrupt Enable" mask="0x40" name="PEC0IE"/>
          <bitfield caption="Compare Or Capture 1 Interrupt Enable" mask="0x20" name="CC1IE"/>
          <bitfield caption="Peripheral Low Counter 2 Interrupt Enable" mask="0x20" name="PEC20IE"/>
          <bitfield caption="Compare Or Capture 0 Interrupt Enable" mask="0x10" name="CC0IE"/>
          <bitfield caption="Timer Underflow Interrupt Level" mask="0x0C" name="UNFINTLVL" values="XCL_UNF_INTLVL"/>
          <bitfield caption="Timer Compare or Capture Interrupt Level" mask="0x03" name="CCINTLVL" values="XCL_CC_INTLVL"/>
        </register>
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x08" size="1">
          <bitfield caption="Timer/Counter 1 Underflow Interrupt Flag" mask="0x80" name="UNF1IF"/>
          <bitfield caption="Peripheral Counter 1 Interrupt Flag" mask="0x80" name="PEC1IF"/>
          <bitfield caption="Peripheral High Counter 2 Interrupt Flag" mask="0x80" name="PEC21IF"/>
          <bitfield caption="Timer/Counter 0 Underflow Interrupt Flag" mask="0x40" name="UNF0IF"/>
          <bitfield caption="Peripheral Counter 0 Interrupt Flag" mask="0x40" name="PEC0IF"/>
          <bitfield caption="Compare or Capture Channel 1 Interrupt Flag" mask="0x20" name="CC1IF"/>
          <bitfield caption="Peripheral Low Counter 2 Interrupt Flag" mask="0x20" name="PEC20IF"/>
          <bitfield caption="Compare or Capture Channel 0 Interrupt Flag" mask="0x10" name="CC0IF"/>
        </register>
        <register caption="Peripheral Lenght Control Register " name="PLC" offset="0x09" size="1">
          <bitfield caption="Peripheral Lenght Control Bits" mask="0xFF" name="PLC"/>
        </register>
        <register caption="Counter Register Low" name="CNTL" offset="0x0A" size="1">
          <bitfield caption="BTC0 Counter Byte" mask="0xFF" name="BCNTO"/>
          <bitfield caption="TC16 Counter Low Byte" mask="0xFF" name="CNTL"/>
          <bitfield caption="Peripheral Counter 0 Byte" mask="0xFF" name="PCNTO"/>
        </register>
        <register caption="Counter Register High" name="CNTH" offset="0x0B" size="1">
          <bitfield caption="BTC1 Counter Byte" mask="0xFF" name="BCNT1"/>
          <bitfield caption="TC16 Counter High Byte" mask="0xFF" name="CNTH"/>
          <bitfield caption="Peripheral Counter 1 Byte" mask="0xFF" name="PCNT1"/>
          <bitfield caption="Peripheral High Counter 2 Bits" mask="0xF0" name="PCNT21"/>
          <bitfield caption="Peripheral Low Counter 2 Bits" mask="0x0F" name="PCNT20"/>
        </register>
