avr-rust/avrd/packs/xmegae/ATxmega16E5.atdf
        <register caption="Control Register G Set" name="CTRLGSET" offset="0x09" size="1">
          <bitfield caption="Timer/Counter Stop" mask="0x10" name="STOP"/>
          <bitfield caption="Command" mask="0x0C" name="CMD" values="TC45_CMD"/>
          <bitfield caption="Lock Update" mask="0x02" name="LUPD"/>
          <bitfield caption="Counter Direction" mask="0x01" name="DIR"/>
        </register>
        <register caption="Control Register H Clear" name="CTRLHCLR" offset="0x0A" size="1">
          <bitfield caption="Channel B Compare or Capture Buffer Valid" mask="0x04" name="CCBBV"/>
          <bitfield caption="Channel A Compare or Capture Buffer Valid" mask="0x02" name="CCABV"/>
          <bitfield caption="Period Buffer Valid" mask="0x01" name="PERBV"/>
          <bitfield caption="Channel Low B Compare or Capture Buffer Valid" mask="0x04" name="LCCBBV"/>
          <bitfield caption="Channel Low A Compare or Capture Buffer Valid" mask="0x02" name="LCCABV"/>
          <bitfield caption="Period Low Buffer Valid" mask="0x01" name="LPERBV"/>
        </register>
        <register caption="Control Register H Set" name="CTRLHSET" offset="0x0B" size="1">
          <bitfield caption="Channel B Compare or Capture Buffer Valid" mask="0x04" name="CCBBV"/>
          <bitfield caption="Channel A Compare or Capture Buffer Valid" mask="0x02" name="CCABV"/>
          <bitfield caption="Period Buffer Valid" mask="0x01" name="PERBV"/>
          <bitfield caption="Channel Low B Compare or Capture Buffer Valid" mask="0x04" name="LCCBBV"/>
          <bitfield caption="Channel Low A Compare or Capture Buffer Valid" mask="0x02" name="LCCABV"/>
          <bitfield caption="Period Low Buffer Valid" mask="0x01" name="LPERBV"/>
        </register>
        <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
          <bitfield caption="Channel B Compare or Capture Interrupt Flag" mask="0x20" name="CCBIF"/>
          <bitfield caption="Channel A Compare or Capture Interrupt Flag" mask="0x10" name="CCAIF"/>
          <bitfield caption="Trigger Restart Interrupt Flag" mask="0x04" name="TRGIF"/>
          <bitfield caption="Error Interrupt Flag" mask="0x02" name="ERRIF"/>
          <bitfield caption="Overflow/Underflow Interrupt Flag" mask="0x01" name="OVFIF"/>
          <bitfield caption="Channel Low B Compare or Capture Interrupt Flag" mask="0x20" name="LCCBIF"/>
          <bitfield caption="Channel Low A Compare or Capture Interrupt Flag" mask="0x10" name="LCCAIF"/>
        </register>
        <register caption="Temporary Register For 16-bit Access" name="TEMP" offset="0x0F" size="1"/>
        <register caption="Count" name="CNT" offset="0x20" size="2"/>
        <register caption="Period" name="PER" offset="0x26" size="2"/>
        <register caption="Compare or Capture A" name="CCA" offset="0x28" size="2"/>
        <register caption="Compare or Capture B" name="CCB" offset="0x2A" size="2"/>
        <register caption="Period Buffer" name="PERBUF" offset="0x36" size="2"/>
        <register caption="Compare Or Capture A Buffer" name="CCABUF" offset="0x38" size="2"/>
        <register caption="Compare Or Capture B Buffer" name="CCBBUF" offset="0x3A" size="2"/>
      </register-group>
      <value-group caption="Clock Selection" name="TC45_CLKSEL">
        <value caption="Timer Off" name="OFF" value="0x00"/>
        <value caption="System Clock" name="DIV1" value="0x01"/>
        <value caption="System Clock / 2" name="DIV2" value="0x02"/>
        <value caption="System Clock / 4" name="DIV4" value="0x03"/>
        <value caption="System Clock / 8" name="DIV8" value="0x04"/>
        <value caption="System Clock / 64" name="DIV64" value="0x05"/>
        <value caption="System Clock / 256" name="DIV256" value="0x06"/>
        <value caption="System Clock / 1024" name="DIV1024" value="0x07"/>
        <value caption="Event Channel 0" name="EVCH0" value="0x08"/>
        <value caption="Event Channel 1" name="EVCH1" value="0x09"/>
        <value caption="Event Channel 2" name="EVCH2" value="0x0A"/>
        <value caption="Event Channel 3" name="EVCH3" value="0x0B"/>
        <value caption="Event Channel 4" name="EVCH4" value="0x0C"/>
        <value caption="Event Channel 5" name="EVCH5" value="0x0D"/>
        <value caption="Event Channel 6" name="EVCH6" value="0x0E"/>
        <value caption="Event Channel 7" name="EVCH7" value="0x0F"/>
      </value-group>
      <value-group caption="Byte Mode" name="TC45_BYTEM">
        <value caption="16-bit mode" name="NORMAL" value="0x00"/>
        <value caption="Timer/Counter Operating in Byte Mode Only" name="BYTEMODE" value="0x01"/>
      </value-group>
      <value-group caption="Circular Enable Mode" name="TC45_CIRCEN">
        <value caption="Circular Buffer Disabled" name="DISABLE" value="0x00"/>
        <value caption="Circular Buffer Enabled on PER/PERBUF" name="PER" value="0x01"/>
        <value caption="Circular Buffer Enabled on CCA/CCABUF" name="CCA" value="0x02"/>
        <value caption="Circular Buffer Enabled on All Buffered Registers" name="BOTH" value="0x03"/>
      </value-group>
      <value-group caption="Waveform Generation Mode" name="TC45_WGMODE">
        <value caption="Normal Mode" name="NORMAL" value="0x00"/>
        <value caption="Frequency Generation Mode" name="FRQ" value="0x01"/>
        <value caption="Single Slope" name="SINGLESLOPE" value="0x03"/>
        <value caption="Dual Slope, Update on TOP" name="DSTOP" value="0x05"/>
        <value caption="Dual Slope, Both" name="DSBOTH" value="0x06"/>
        <value caption="Dual Slope, Update on BOTTOM" name="DSBOTTOM" value="0x07"/>
      </value-group>
      <value-group caption="Event Action" name="TC45_EVACT">
        <value caption="No Event Action" name="OFF" value="0x00"/>
        <value caption="Fault Mode 1 capture" name="FMODE1" value="0x01"/>
        <value caption="Fault Mode 2 capture" name="FMODE2" value="0x02"/>
        <value caption="Up/down count" name="UPDOWN" value="0x03"/>
        <value caption="Quadrature decode" name="QDEC" value="0x04"/>
        <value caption="Restart" name="RESTART" value="0x05"/>
        <value caption="Pulse-width Capture" name="PWF" value="0x06"/>
      </value-group>
      <value-group caption="Event Selection" name="TC45_EVSEL">
        <value caption="No Event Source" name="OFF" value="0x00"/>
        <value caption="Event Channel 0" name="CH0" value="0x08"/>
        <value caption="Event Channel 1" name="CH1" value="0x09"/>
        <value caption="Event Channel 2" name="CH2" value="0x0A"/>
        <value caption="Event Channel 3" name="CH3" value="0x0B"/>
        <value caption="Event Channel 4" name="CH4" value="0x0C"/>
        <value caption="Event Channel 5" name="CH5" value="0x0D"/>
        <value caption="Event Channel 6" name="CH6" value="0x0E"/>
        <value caption="Event Channel 7" name="CH7" value="0x0F"/>
      </value-group>
