avr-rust/avrd/packs/xmegae/ATxmega16E5.atdf
        <register caption="Pattern Generation Overwrite Buffer Register" name="PGOBUF" offset="0x0B" size="1"/>
        <register caption="Pattern Generation Value Buffer Register" name="PGVBUF" offset="0x0C" size="1"/>
        <register caption="Output Override Disable Register " name="OUTOVDIS" offset="0x0F" size="1"/>
      </register-group>
      <value-group caption="Output Matrix Mode" name="WEX_OTMX">
        <value caption="Default Ouput Matrix Mode" name="DEFAULT" value="0x00"/>
        <value caption="First Output matrix Mode" name="FIRST" value="0x01"/>
        <value caption="Second Output matrix Mode" name="SECOND" value="0x02"/>
        <value caption="Third Output matrix Mode" name="THIRD" value="0x03"/>
        <value caption="Fourth Output matrix Mode" name="FOURTH" value="0x04"/>
      </value-group>
    </module>
    <module name="HIRES" id="I3620" version="XMEGAE" caption="High-Resolution Extension">
      <register-group caption="High-Resolution Extension" name="HIRES" size="1">
        <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="High Resolution Plus" mask="0x0C" name="HRPLUS" values="HIRES_HRPLUS"/>
          <bitfield caption="High Resolution Mode" mask="0x03" name="HREN" values="HIRES_HREN"/>
        </register>
      </register-group>
      <value-group caption="High Resolution Plus Mode" name="HIRES_HRPLUS">
        <value caption="No Hi-Res Plus" name="NONE" value="0x00"/>
        <value caption="Hi-Res Plus enabled on Timer 4" name="HRP4" value="0x01"/>
        <value caption="Hi-Res Plus enabled on Timer 5" name="HRP5" value="0x02"/>
        <value caption="Hi-Res Plus enabled on Timer 4 and 5" name="BOTH" value="0x03"/>
      </value-group>
      <value-group caption="High Resolution Mode" name="HIRES_HREN">
        <value caption="No Hi-Res" name="NONE" value="0x00"/>
        <value caption="Hi-Res enabled on Timer 4" name="HRP4" value="0x01"/>
        <value caption="Hi-Res enabled on Timer 5" name="HRP5" value="0x02"/>
        <value caption="Hi-Res enabled on Timer 4 and 5" name="BOTH" value="0x03"/>
      </value-group>
    </module>
    <module name="USART" id="I4000" version="XMEGAE" caption="Universal Asynchronous Receiver-Transmitter">
      <register-group caption="Universal Synchronous/Asynchronous Receiver/Transmitter" name="USART" size="8">
        <register caption="Data Register" name="DATA" offset="0x00" size="1"/>
        <register caption="Status Register" name="STATUS" offset="0x01" size="1">
          <bitfield caption="Receive Interrupt Flag" mask="0x80" name="RXCIF"/>
          <bitfield caption="Transmit Interrupt Flag" mask="0x40" name="TXCIF"/>
          <bitfield caption="Data Register Empty Flag" mask="0x20" name="DREIF"/>
          <bitfield caption="Frame Error" mask="0x10" name="FERR"/>
          <bitfield caption="Buffer Overflow" mask="0x08" name="BUFOVF"/>
          <bitfield caption="Parity Error" mask="0x04" name="PERR"/>
          <bitfield caption="Receive Start Bit Interrupt Flag" mask="0x02" name="RXSIF"/>
          <bitfield caption="Receive Bit 8" mask="0x01" name="RXB8"/>
          <bitfield caption="Data Reception Flag" mask="0x01" name="DRIF"/>
        </register>
        <register caption="Control Register A" name="CTRLA" offset="0x02" size="1">
          <bitfield caption="Receive Start Interrupt Enable" mask="0x80" name="RXSIE"/>
          <bitfield caption="Data Reception Interrupt Enable" mask="0x40" name="DRIE"/>
          <bitfield caption="Receive Interrupt Level" mask="0x30" name="RXCINTLVL" values="USART_RXCINTLVL"/>
          <bitfield caption="Transmit Interrupt Level" mask="0x0C" name="TXCINTLVL" values="USART_TXCINTLVL"/>
          <bitfield caption="Data Register Empty Interrupt Level" mask="0x03" name="DREINTLVL" values="USART_DREINTLVL"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x03" size="1">
          <bitfield caption="One Wire Mode" mask="0x80" name="ONEWIRE"/>
          <bitfield caption="Start Frame Detection Enable" mask="0x40" name="SFDEN"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
          <bitfield caption="Double transmission speed" mask="0x04" name="CLK2X"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x02" name="MPCM"/>
          <bitfield caption="Transmit bit 8" mask="0x01" name="TXB8"/>
        </register>
        <register caption="Control Register C" name="CTRLC" offset="0x04" size="1">
          <bitfield caption="Communication Mode" mask="0xC0" name="CMODE" values="USART_CMODE"/>
          <bitfield caption="Parity Mode" mask="0x30" name="PMODE" values="USART_PMODE"/>
          <bitfield caption="Stop Bit Mode" mask="0x08" name="SBMODE"/>
          <bitfield caption="Character Size" mask="0x07" name="CHSIZE" values="USART_CHSIZE"/>
        </register>
        <register caption="Control Register D" name="CTRLD" offset="0x05" size="1">
          <bitfield caption="Receive Interrupt Level" mask="0x30" name="DECTYPE" values="USART_DECTYPE"/>
          <bitfield caption="Transmit Interrupt Level" mask="0x0C" name="LUTACT" values="USART_LUTACT"/>
          <bitfield caption="Data Register Empty Interrupt Level" mask="0x03" name="PECACT" values="USART_PECACT"/>
        </register>
        <register caption="Baud Rate Control Register A" name="BAUDCTRLA" offset="0x06" size="1">
          <bitfield caption="Baud Rate Selection Bits [7:0]" mask="0xFF" name="BSEL"/>
        </register>
        <register caption="Baud Rate Control Register B" name="BAUDCTRLB" offset="0x07" size="1">
          <bitfield caption="Baud Rate Scale" mask="0xF0" name="BSCALE"/>
          <bitfield caption="Baud Rate Selection bits[11:8]" mask="0x0F" name="BSEL"/>
        </register>
      </register-group>
      <value-group caption="Receive Start Interrupt level" name="USART_RXSINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Receive Complete Interrupt level" name="USART_RXCINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Transmit Complete Interrupt level" name="USART_TXCINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Data Register Empty Interrupt level" name="USART_DREINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Character Size" name="USART_CHSIZE">
        <value caption="Character size: 5 bit" name="5BIT" value="0x00"/>
        <value caption="Character size: 6 bit" name="6BIT" value="0x01"/>
        <value caption="Character size: 7 bit" name="7BIT" value="0x02"/>
        <value caption="Character size: 8 bit" name="8BIT" value="0x03"/>
        <value caption="Character size: 9 bit" name="9BIT" value="0x07"/>
      </value-group>
      <value-group caption="Communication Mode" name="USART_CMODE">
        <value caption="Asynchronous Mode" name="ASYNCHRONOUS" value="0x00"/>
        <value caption="Synchronous Mode" name="SYNCHRONOUS" value="0x01"/>
        <value caption="IrDA Mode" name="IRDA" value="0x02"/>
        <value caption="Master SPI Mode" name="MSPI" value="0x03"/>
      </value-group>
      <value-group caption="Parity Mode" name="USART_PMODE">
        <value caption="No Parity" name="DISABLED" value="0x00"/>
        <value caption="Even Parity" name="EVEN" value="0x02"/>
        <value caption="Odd Parity" name="ODD" value="0x03"/>
      </value-group>
      <value-group caption="Encoding and Decoding Type" name="USART_DECTYPE">
        <value caption="DATA Field Encoding" name="DATA" value="0x00"/>
        <value caption="Start and Data Fields Encoding" name="SDATA" value="0x02"/>
        <value caption="Start and Data Fields Encoding, with invertion in START field" name="NOTSDATA" value="0x03"/>
      </value-group>
